app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    # @post= Post.find(params[:id])
    # byebug
    @post = Post.find(params[:id])